n = int(input())
lst = list(map(int, input().split()))

#묶음으로 나눠서, 각 묶음별 합이 짝홀짝홀...
#순서 상관없음, 최대 몇 묶음? 최대한 많이 나눠라

#합이 짝: 홀이 짝수 개 + 짝(0개 이상), 짝
#합이 홀: 홀이 홀수 개 + 짝(0개 이상)

even = 0
odd = 0
for num in lst:
    if num % 2 == 0:
        even += 1
    else:
        odd += 1

if even == 0:
    if odd % 3 == 0:
        print((odd // 3) * 2)
    elif odd % 3 == 1:
        print(((odd // 3) - 1) * 2 + 1)
    else:
        print((odd // 3) * 2 + 1)
else:
    if even - odd == 0 or even - odd == 1:
        print(n)
    elif even - odd == 2:
        print(n-1)
    elif even - odd >= 3:
        print(odd * 2 + 1)
    elif odd - even == 1:
        print(n-2)
    elif (odd - even) % 2 == 0:
        print(even * 2 + 1)
    elif odd - even == 3:
        print(n-1)
    elif (odd - even) % 2 == 1:
        print(even * 2 + 3)

#짝수가 없으면
#3으로 나누고, 나머지 0: 몫 * 2, 1: (몫-1) * 2 + 1, 2: 몫 * 2 + 1
#홀: 12 => 2 1 2 1 2 1 2 1 (8)
#홀: 13 => 2 1 2 1 2 1 4 (7)
#홀: 14 => 2 1 2 1 2 1 2 1 2 (9)
#홀: 15 => 2 1 2 1 2 1 2 1 2 1 (10)

#짝수가 있으면
#짝이 홀보다 0이나 1개 많으면
#홀 3 짝 4 => 7
#홀 4 짝 5 => 9
#홀 5 짝 5 => 10

#짝이 홀보다 2개 많으면 n-1
#홀 4 짝 6 => 9
#홀 3 짝 5 => 7
#홀 2 짝 4 => 5

#짝이 홀보다 3개 이상 많으면 홀 * 2 + 1
#홀 1 짝 4 => 3
#홀 2 짝 5 => 5
#홀 3 짝 6 => 7
#홀 10 짝 13 => 21

#홀이 짝보다 1개 더 많으면 n-2
#홀 6 짝 5 => 9
#홀 5 짝 4 => 7

#홀이 짝보다 2개/4개/6 많으면 짝 * 2 + 1
#홀 3 짝 1 => 3
#홀 8 짝 6 => 13
#홀 10 짝 8 => 17

#홀이 짝보다 3개 많으면 n-1
#홀 4 짝 1 => 4
#홀 6 짝 3 => 8
#홀 10 짝 7 => 16

#홀이 짝보다 5개, 7 많으면 짝 * 2 + 3
#홀 6 짝 1 => 5
#홀 7 짝 2 => 7
#홀 8 짝 3 => 9
#홀 9 짝 4 => 11

#홀이 짝보다 7개 많으면 짝 * 2 + 3
#홀 7 짝 1 => 3
#홀 8 짝 2 => 5
#홀 8 짝 3 => 9
#홀 9 짝 4 => 11